app/controllers/users_controller.rb

  def create
    @user = User.create!(user_params)
---
INSERT INTO "users" ("type", "full_name", "email", "password_digest", "created_at", "updated_at", "allow_email", "user_type") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"